//Бібліотеки
#include <iostream>
#include <locale>

//Основна функція
int main()
{
	//Мова та постійне використання std
	using namespace std;
	setlocale(0, "rus");

	//Меню
	cout << "----------------Гра Кiстки---------------\n" << endl;
	cout << "1.Грати\n" << endl;
	cout << "2.Iнструкцiя\n" << endl;
	cout << "3.Вихiд\n" << endl;
	cout << "------------------------------------------\n" << endl;

	//Вибирання пункту з меню та заповнення змінної
	cout << "Введiть цифру з меню: ";
	int menu_sumbol;
	cin >> menu_sumbol;
	cout << endl;

	//Основний алгоритм гри
	switch (menu_sumbol)
	{
		//Основний принцип гри
	case 1 :
		cout << "lalallalaal";
		break;

		//Інструкція
	case 2:
		cout << "-----------------------------------------------Iнструкцiя-----------------------------------------------\n" << endl;
		cout << R"(Гра Кiстки -- це гра, яка моделює два кубика в дiапазонi вiд 1 до 6 (в сумарностi виходить ДО 12).
Наприклад: Якщо сума цифр, щo випали менше 7 i гравець задумав число менше 7, вiн виграє зроблену ставку.
Якщо сума цифр, що випали, бiльше 7 i гравець задумав число бiльше 7, вiн також виграє зроблену ставку.
Якщо граючий вгадав суму цифр, вiн отримує вчетверо бiльше очок, нiж зроблена ставка.
Ставка програна, якщо немає жодна з описаних cитуацiй. 
У початковий момент у того, хто грає 100 очок. )" << endl << endl;
		cout << "--------------------------------------------------------------------------------------------------------\n" << endl;
		break;

		//Вихід
	case 3:
		cout << "----------------Вихiд---------------\n" << endl;
		cout << "Якщо задумаєш пограти, заходь!\n" << endl;
		cout << "------------------------------------\n" << endl;
		return 2;

		break;

		//Помилка при виборі меню
	default:
		cerr << "Такої цифри намає!!!\n" << endl;
		return 1;
		break;
	}

	return 0;
}
