//Бібліотеки
#include <iostream>
#include <locale>
#include <ctime>

//Основна функція
int main()
{
	//Мова та постійне використання std
	using namespace std;
	setlocale(0, "rus");

	//Меню
	cout << "----------------Гра Кiстки---------------\n" << endl;
	cout << "1.Грати\n" << endl;
	cout << "2.Iнструкцiя\n" << endl;
	cout << "3.Вихiд\n" << endl;
	cout << "------------------------------------------\n" << endl;

	//Вибирання пункту з меню та заповнення змінної
	cout << "Введiть цифру з меню: ";
	int menu_sumbol;
	cin >> menu_sumbol;
	cout << endl;

	//Основний алгоритм гри
	switch (menu_sumbol)
	{
		//Основний принцип гри
	case 1 :
		//Заповнюємо змінну числом яким ми хочему загадати
		cout << "Введiть число суми костей якi ви хочете загадати: ";
		int number_sum_kost;
		cin >> number_sum_kost;

		cout << endl;

		//Функція яка генерує випадкові числа 
		srand(static_cast<unsigned>(time(nullptr)));

		//Кістка один
		int kost1;
		kost1 = rand() % 7;

		//Кістка друга
		int kost2;
		kost2 = rand() % 7;

		//Виводить результати 
		cout << "Вам випали костi " << kost1 << " та " << kost2 << "." << endl;

		cout << endl;

		//Додає дві кістки в сумму та виводить їх суму
		int sum_kost_console; 
		sum_kost_console = kost1 + kost2;
		cout << "В сумi виходить: " << sum_kost_console << endl;

		cout << endl;

		//Якщо сума яку загадав користувач менше 7 та кубики випали менше 7, тоді виводе текст що виграв
		if (number_sum_kost < 7 &&  number_sum_kost == 7)
		{
			if (number_sum_kost < sum_kost_console)
			{
				cout << "Ви вийграли ставку!" << endl;;
			}
		}

		//Якщо сума яку загадав користувач та вона рівно та сама що й випали кубики, тоді гравець отримує в четверо більше очок
		if (number_sum_kost == sum_kost_console)
		{
			cout << "Ви виграли ставу та виграєте ствку в четверо бiльше!" << endl;;
		}

		//Якщо сума яку загадав користувач більше 7 та кубики випали більше 7, тоді виводе текст що виграв
		if (number_sum_kost > 7 && number_sum_kost == 8)
		{
			if (number_sum_kost > sum_kost_console)
			{
				cout << "Ви вийграли ставку!" << endl;;
			}
		}

		//Якщо не із жодних ситуацій не співпадає
		else
		{
			cout << "Ви програли" << endl;;
		}

		break;

		//Інструкція
	case 2 :
		cout << "-----------------------------------------------Iнструкцiя-----------------------------------------------\n" << endl;
		cout << R"(Гра Кiстки -- це гра, яка моделює два кубика в дiапазонi вiд 1 до 6 (в сумарностi виходить ДО 12).
Наприклад: Якщо сума цифр, щo випали менше 7 i гравець задумав число менше 7, вiн виграє зроблену ставку.
Якщо сума цифр, що випали, бiльше 7 i гравець задумав число бiльше 7, вiн також виграє зроблену ставку.
Якщо граючий вгадав суму цифр, вiн отримує вчетверо бiльше очок, нiж зроблена ставка.
Ставка програна, якщо немає жодна з описаних cитуацiй. 
У початковий момент у того, хто грає 100 очок. )" << endl << endl;
		cout << "--------------------------------------------------------------------------------------------------------\n" << endl;
		break;

		//Вихід
	case 3 :
		cout << "----------------Вихiд---------------\n" << endl;
		cout << "Якщо задумаєш пограти, заходь!\n" << endl;
		cout << "------------------------------------\n" << endl;
		return 2;

		break;

		//Помилка при виборі меню
	default :
		cerr << "Такої цифри намає!!!\n" << endl;
		return 1;
		break;
	}

	return 0;
}
